#ifndef ___MY_MSGS___
#define ___MY_MSGS___


#define INFO_MSG "\n- Формат входных данных: пункт меню (от 0 до 2)\n\n\
- Операции, производимые программой: указаны с пунктах меню\n\n\
- Формат выходных данных: граф\n\n"
#define INPUT_GRAPH_FILENAME_MSG "\nВведите имя файла, в котором хранится граф (в виде матрицы смежности): "
#define ERR_ALLOC_MSG "\n%sНе удалось выделить память. Попробуйте снова.%s\n\n"
#define ERR_CODE_MSG "\n%sНекорректный код. Попробуйте снова.%s\n\n"
#define ERR_READING_FILENAME_MSG "\n%sОшибка чтения названия файла. Попробуйте снова.%s\n"
#define ERR_FILE_MSG "\n%sОшибка чтения файла. Попробуйте снова.%s\n"
#define MENU_MSG  "\n\
1  --  Вывести граф\n\
2  --  Найти самый длинный простой путь в графе\n\
0  --  Выход\n: "

#endif // ___MY_MSGS___
